{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "Qdlin", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 1000, 1], "dtype": "float32", "sparse": false, "name": "Qdlin"}, "inbound_nodes": []}, {"name": "Tdlin", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 1000, 1], "dtype": "float32", "sparse": false, "name": "Tdlin"}, "inbound_nodes": []}, {"name": "detail_concat", "class_name": "Concatenate", "config": {"name": "detail_concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["Qdlin", 0, 0, {}], ["Tdlin", 0, 0, {}]]]}, {"name": "convolution", "class_name": "TimeDistributed", "config": {"name": "convolution", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [9], "strides": [3], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["detail_concat", 0, 0, {}]]]}, {"name": "conv_pool", "class_name": "TimeDistributed", "config": {"name": "conv_pool", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": null, "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}}, "inbound_nodes": [[["convolution", 0, 0, {}]]]}, {"name": "conv2", "class_name": "TimeDistributed", "config": {"name": "conv2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [9], "strides": [3], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["conv_pool", 0, 0, {}]]]}, {"name": "pool2", "class_name": "TimeDistributed", "config": {"name": "pool2", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": null, "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "conv3", "class_name": "TimeDistributed", "config": {"name": "conv3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [9], "strides": [3], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"name": "pool3", "class_name": "TimeDistributed", "config": {"name": "pool3", "trainable": true, "dtype": "float32", "layer": {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "dtype": null, "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}}}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "convolution_flat", "class_name": "TimeDistributed", "config": {"name": "convolution_flat", "trainable": true, "dtype": "float32", "layer": {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": null, "data_format": "channels_last"}}}, "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"name": "dropout_cnn", "class_name": "TimeDistributed", "config": {"name": "dropout_cnn", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": null, "rate": 0.3, "noise_shape": null, "seed": null}}}, "inbound_nodes": [[["convolution_flat", 0, 0, {}]]]}, {"name": "IR", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 1], "dtype": "float32", "sparse": false, "name": "IR"}, "inbound_nodes": []}, {"name": "Discharge_time", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 1], "dtype": "float32", "sparse": false, "name": "Discharge_time"}, "inbound_nodes": []}, {"name": "QD", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 1], "dtype": "float32", "sparse": false, "name": "QD"}, "inbound_nodes": []}, {"name": "all_concat", "class_name": "Concatenate", "config": {"name": "all_concat", "trainable": true, "dtype": "float32", "axis": 2}, "inbound_nodes": [[["dropout_cnn", 0, 0, {}], ["IR", 0, 0, {}], ["Discharge_time", 0, 0, {}], ["QD", 0, 0, {}]]]}, {"name": "recurrent", "class_name": "LSTM", "config": {"name": "recurrent", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "inbound_nodes": [[["all_concat", 0, 0, {}]]]}, {"name": "dropout_lstm", "class_name": "Dropout", "config": {"name": "dropout_lstm", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["recurrent", 0, 0, {}]]]}, {"name": "hidden", "class_name": "Dense", "config": {"name": "hidden", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_lstm", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 2, "activation": "clippy", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["hidden", 0, 0, {}]]]}], "input_layers": [["Qdlin", 0, 0], ["Tdlin", 0, 0], ["IR", 0, 0], ["Discharge_time", 0, 0], ["QD", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}